///// 로드구역 //////////////////////////////
    $(function(){
                  
        var sld2 = $(".ban_box");
        var sldCnt2 = sld2.find("img").length;
        
        
        var sldSts2 = 0;//슬라이드 상태값
        // 0 자동상태, 1 멈춤상태
        
        $(".cir_off2 li").first().click(function(){
            var v1,v2;
            if(sldSts2===0){
                v1=1;
                v2=0;
                
            console.log("멈춤버튼");
                clearInterval(autoI);
                
                
            } 
            else{
                v1=0;
                v2=1;
            console.log("시작버튼");
                autoSlide();
                
            }
            
            $("img:last-child",this).css({
                opacity: v1
            });
            
            $("img:first-child",this).css({
                opacity: v2
            });
            
            // 상태값 변경
            sldSts2 ? sldSts2 = 0 : sldSts2 = 1;            
        });////// click //////////////////////
                // 슬라이드전역변수    
    var snum = 0;    
         // 인터발함수(지우기위해 만든변수)
    var autoI;
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////
  var prot = 0;        
  var chgImg2 = function(dir){// dir = 방향(0-왼쪽, 1-오른쪽)
                
                //console.log("광클상태값1 :"+prot);
                
                // 0.광클금지 ////////////////////////////
                
                // (1) if문으로 상태값 막기!
                if(prot) return false;//돌아가!
                // prot===1이면 돌아가
                
                // (2) 상태값 막기(1)로 변경
                prot = 1;//상태값 1로 변경!
                //console.log("광클상태값2 :"+prot);
                
                // (3) 작동시간 후에 광클상태값을 0으로 풀어주기
                setTimeout(function(){
                    prot=0;//상태풀기
                    //console.log("광클상태값3 :"+ prot);
                                     
                 },400);
                // setTimeout(함수,시간) - 설정시간 후 한번 함수호출!
                // 시간이 400이면 0.4초이므로 이미지가 넘어가는 
                // 트랜지션 시간인 0.4초간 광클을 막아준다!
                ////////////////// 광클 금지 ////////////
                
                // 1. 함수호출 및 전달값 확인
                //console.log("나야나!"+dir);
                
                // 2. 변경된 img리스트 읽어오기
                var ilist = $(".ban_box img")
                // 첫번째 이미지
                var fele = ilist.eq(0);
                // 마지막 이미지
                var lele = ilist.eq(ilist.length-1);
                
                
                // 3.오른쪽버튼 클릭시 맨앞요소 맨뒤로 이동하기
                if(dir){ // 1이면 true
                    // 맨앞요소 맨뒤로 이동
                    $(".ban_box").append(fele);
                    
                }////// if //////////////////////////
                
                // 4.왼쪽버튼 클릭시 맨뒤요소 맨앞으로 이동하기
                else{
                    $(".ban_box").insertBefore(lele,fele);
                    
                }///// else ////////////////////////
                
            }/////// chgImg 함수 /////////////////////
            /////////////////////////////////////////        
        
        
        
             

///////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////
        
    /*////////////////////////////////////////////
        //함수명: autoSlide
        //기능: 자동넘기기 셋팅함수(인터발함수)
    ////////////////////////////////////////////*/
    var autoSlide = function () {
        autoI = setInterval(function () {
              chgImg2(1)
            },3000);
            
   
        
    }; ////// autoSlide함수 //////////////////////
    //////////////////////////////////////////////
        
        
        // 할당형함수 아래에서 처음 호출해야함!
    autoSlide(); //최초호출!


    // 타임아웃변수(쓰나미방지용 지우기변수)
    var autoT;
    /*////////////////////////////////////////////
        함수명: clearAuto
        기능: 자동넘김 지우기함수(클리어인터발함수)
    */ ////////////////////////////////////////////
    var clearAuto = function () {

        // 자동넘김 할당된 변수를 지운다(autoI)
        clearInterval(autoI);
        // 타임아웃 실행쓰나미 방지용 타임아웃 지우기를 꼭한다!
        clearTimeout(autoT);

        // 안건드리면 5초후 다시 자동호출하기!
        // 매번 호출될때 위에서 지우므로 단 하나만 남아있음!
        autoT = setTimeout(autoSlide, 5000);

    }; ////// clearAuto함수 /////////////////////////


        
    ////////////////////////////////////////////////
    });/////////////// 로드구역 ///////////////////////
///////////////////////////////////////////////////////
///////////////////////////////////////////////////////



